{
  "profile": {
    "experience": [
      {
        "id":0,
        "companyHeader":"TCS - Silicon Valley Bank (SVB) / June 2021 - Present / Consultant",
        "jobDescription":"Creating connected services based on event driven architecture and microservices architecture. The tech stack is based on NodeJS, Strongloop, TypeScript, KafkaJs and Oracle.",
        "projects":[
          {
            "id":0,
            "title":"Client Onboarding",
            "description":"Fullstack developer, working with Integrations, API and UI team on creating a portal for onboarding client/businesses to SVB.",
            "responsibilities": [
              "Create microservices based on event driven architecture on NodeJS stack using strongloop framework and kafka queues using kafkaJs.",
              "API management using APIGEE, create inbound and outbound proxies using custom Javascript policies.",
              "Create reusable npm packages and integrate with microservices.",
              "Create test suites for React front end application and microservices.",
              "Work with Devops to create jenkins pipelines to deploy the services to openShift."
            ]
          }          
        ]
      },
      {
        "id":0,
        "companyHeader":"SWISS RE / June 2018 - Present / Senior Full Stack Developer",
        "jobDescription":"Working as a senior full stack developer in creating B2B2C platforms with focus on Life insurance and Medicare supplement products.",
        "projects":[
          {
            "id":0,
            "title":"Life Insurance and Medicare Supplement Platform",
            "description":"Lead the development on creating a B2B2C insurance platform for customers and insurance agents using Angular.",
            "responsibilities": [
              "Worked with Software Architect and Senior Developers to design and identify tech stack for the platform.",
              "Lead a team of UI developers in creating the web interface using Angular.",
              "Worked closely with UX designer, backend developers, decision management and modeling analysts and business analysts to create page flow diagrams, technical and API documentation and give high level estimates.",
              "Created Angular Custom Library for reusable components.",
              "Experience using Angular features including Http Interceptors, Lazy Loading Feature Modules, Custom Validators, RxJS and NgRx library for state management.",
              "Integrated with Google Analytics and Azure Application Insights for page tracking and performance.",
              "Created unit test suite using Jest and integrated with Azure build pipelines for executing and generating test results and code coverage reports and ensured the team maintained an approved code coverage.",
              "Created several in-house apps, proof-of-concept apps using Python,React, Redux, Angular, Python, C#, and ",
              "Lead the daily stand up calls regularly." 
            ]
          },
          {
            "id":1,
            "title":"Data Migration",
            "description":"Worked with data team in creating light weight ELT processes for migrating data from third party sources to data warehouse using C#, Python, Azure Functions, Logic Apps, Azure Data Factory.",
            "responsibilities": [
              "Lead a Angular team of 3 including data scientist and DevOps engineer in identifying a tool for secure data access for business users with various roles.",
              "Created Azure Functions using Python 3.x and C# to migrate data from SFTP location, ADLS to SQL data warehouse.",
              "Created Azure Logic Apps by integrating out-of-box Azure Services with custom Azure Functions (C#) for data processing, report generation and publication via email to business users.",
              "Created ETL processes using Azure Data Factory (ADF) V1 and V2 by integrating out-of-box Azure services with custom C# code.",
              "Extensive use of PowerShell and Python scripts for automating several data processing related tasks."              
            ]
          }
        ]
      },
      {
        "id":1,
        "companyHeader":"THE NEW TEACHER PROJECT, NY     /     October 2011 – June 2018     /     Senior Software Developer, DevOps        ",
        "jobDescription":"Worked as a senior full stack developer in creating web applications, migrating legacy applications to AWS and performed DevOps functionalities.",
        "projects":[
          {
            "id":0,
            "title":"Teacher Tracking Systems",
            "description":"Design/Architect and develop applicant tracking systems for teachers using JavaScript, ASP.NET, Node.js, MongoDB, SQL Server on AWS. Leveraged several AWS services including SES, S3, Athena, DynamoDB.",
            "responsibilities": [
              "Designed and developed Applicant Tracking System TeacherTrack2 using .NET and deployed on AWS. The system is used by new and veteran teachers to apply for new teaching positions, by district staff for recruitment and by principals/coaches/evaluators for teacher evaluation.",
              "Designed and developed teacher observation tool Argus using JavaScript and Node.js and deployed on AWS. The system is used by coaches and evaluators for teacher evaluation.",
              "Designed and developed web-based reporting system INRS using .NET and deployed on AWS. The system is used by district staff, principals to generate reports based on district/school/teacher level performance data.",
              "Designed and developed ETL application to create a SQL Server data warehouse using AWS Step Functions, AWS Lambda, DynamoDB and Python (Petl).",
              "Developed Salesforce Lightening components and custom Salesforce API endpoints using APEX Classes, Triggers, Salesforce BulkAPI.",
              "Web development using HTML, CSS, JavaScript (ES6) frameworks such as Angular, Knockout and ASP.NET (Webforms/MVC).",
              "Backend development using languages C#, Node.js, Python and Go with databases SQL Server, MongoDB, PostgreSQL, DynamoDB and AWS RDS.",
              "Implement Serverless architecture by converting monolith services written in WCF to AWS microservices using Lambda/Step functions, S3, SES, DynamoDB Streams. Lambda/Step functions are created using .NET Core, Python and Go.",
              "Designed and developed microservices for Salesforce and Blackboard integration using AWS Lambda functions (.NET Core).",
              "Created a CI/CD pipeline using AWS CloudFormation, Lambda, S3 and PowerShell scripting.",
              "Test-driven development using MbUnit, Galelio, Selenium, qUnit and Jasmine.",
              "Database programming using SQL Server, nHibernate, Entity Framework, Stored Procedures, Views.",
              "Use of Lucene.net for indexing data and Couchbase server for caching.",
              "Extensive use of performance tools such as nHibernate profiler, SQL profiler, dotTrace, NewRelic for improving performance of website in terms of faster load times."
            ]
          },
          {
            "id":1,
            "title":"Operations",
            "description":"Worked with IT Operation team on migrating various applications from inhouse to AWS and Azure. Create staging and production environments for the dev teams and provide production support.",
            "responsibilities": [
              "Helped in setting up beta and production environments.",
              "Provide 24x7 production support which includes addressing infrastructure as well as application alerts.",
              "Automate AWS infrastructure for CI-CD pipeline.",
              "Automation using AWS Powershell CLI for data backups, moving data between different instances and copying data from production instances to staging and dev instances.",
              "Setup monitoring, logging using CloudWatch",
              "Deployed a 3-member MongoDB replica set.",
              "Assisted in migrating applications from Rackspace to AWS.",
              "Setup Monitoring using Alchemy Eye. "
            ]
          }          
        ]
      },
      {
        "id":2,
        "companyHeader":"WIND ANALYTICS, NY     /     October 2011 – June 2018     /     Senior Software Developer, DevOps                                           ",
        "jobDescription":"Worked as a senior software developer in creating web applications for analyzing wind data and provide recommendations on installing a wind turbine.",
        "projects":[
          {
            "id":0,
            "title":"Residential Wind analysis Web Application",
            "description":"Designed a web application using n-Tier architecture for wind turbine installer/property owner to analyze whether a property is cost effective for wind turbine installation using ASP.NET MVC3, C# 4.0, WCF, Silverlight 4.0, SQL Server 2008, ArcGIS Server 10.0 and ESRI Silverlight API.",
            "responsibilities": [
              "Developed authentication module using ASP.NET MVC3 with features such as CAPTCHA.",
              "Integrated with Zoho CRM (Zoho API) for forwarding the customer details to the CRM database.",
              "Integrated with PayPal for payment processing.",
              "Created ArcGIS cached service to create a wind class map for USA using NREL data that shows the average wind pattern.",
              "Created geoprocessing services to determine the wind class for missing areas based on nearest spatial search using Python.",
              "Extensive use of Linq, LinqToSQL, Entity framework and stored procedures for SQL Server CRUD operations and use of Domain Services consumed by the Silverlight.",
              "Coding standards and practices based on MVVM (Silverlight), MVC3, CodeRush Xpress and unit testing." 
            ]
          },
          {
            "id":1,
            "title":"Meteorological Data Checker Application",
            "description":"Developed a web application using n-Tier architecture for wind analyst to process meteorological station data for wind analysis using ASP.NET MVC3, C#4, WCF RIA, Silverlight 4, SQL Server 2008, ArcGIS Server 10.0 and ESRI Silverlight API.",
            "responsibilities": [
              "Created an ArcGIS dynamic service using ArcGIS Server that returns data (over 20,000 met stations) from SQL Server as dynamic tiles/images that change as the data changes.",
              "The application allows an analyst to select a meteorological station and process its data.",
              "Extensive use of Linq, LinqToSQL and Entity framework for SQL Server CRUD operations.",
              "Coding standards and practices MVVM (Silverlight), MVC3 (ASP.NET), StyleCop and unit testing."
              
            ]
          }          
        ]
      },
      {
        "id":3,
        "companyHeader":"FOLIAGE SOFTWARE SYSTEMS, MA     /     June 2010 – April 2011     /      Software Developer                                              ",
        "jobDescription":"Worked as a software developer in creating geographical information systems.",
        "projects":[
          {
            "id":0,
            "title":"VOLPE, Boston, MA",
            "description":"Developed a web application for FAA/NPS personnel to download and process GIS data using ASP.NET 4.0, C# 4.0, Silverlight 4.0, SQL Server 2008, ArcGIS Server 10.0, ArcSDE, ArcGIS API for Silverlight.",
            "responsibilities": [
              "Used Silverlight Telerik Rad Controls for displaying data (tabular and graphical).",
              "Created Web Services to automatically download GIS data (USGS Seamless server) on the server and import it to the ArcSDE database.",
              "Created REST based geoprocessing services using ArcGIS Server, Python and ArcObjects to send large amounts of GIS data as images.",
              "Extended the ArcGIS API for Silverlight for building complex user specific GIS tools that utilized the geoprocessing services/third party web services to analyze the GIS data.",
              "Coding standards and practices based on MVVM pattern, styling using StyleCop and unit testing using MSTest."             
            ]
          },
          {
            "id":1,
            "title":"VOLPE, Boston, MA",
            "description":"Developed a prototype web based geographical information system for FAA using ASP.NET, C#, ArcGIS Server 9.3, ArcSDE 9.3, ArcGIS WebADF in an AGILE process.",
            "responsibilities": [
              "The web-based GIS application had features such as connecting to ArcSDE, editing features (adding, deleting and changing geometry).",
              "Developed custom GIS web controls that extended WebADF controls using C#.",
              "Conversion of WEB ADF based application to Silverlight version."
            ]
          }          
        ]
      },
      {
        "id":4,
        "companyHeader":"INFRASTRUCTURE MANAGEMENT SERVICES, IL     /     December 2007 – July 2010      /      Software Developer         ",
        "jobDescription":"Worked as a Pavement Managent Analyst.",
        "projects":[
          {
            "id":0,
            "title":"Pavement Management Information Systems",
            "description":"Created web and desktop applications for pavement data collection and data analysis. Applications involved in collecting location data, pavement condition data.",
            "responsibilities": [
              "Developed a data collection application using C#, DevExpress, SQL Server that interfaced deflection measurement instrument with a GPS instrument using serial port communication.",
              "Developed a web based PMIS that integrated pavement condition data (Data, Images and Videos) with GIS maps using .NET Framework, Bing Maps and SQL Server.",
              "Developed an online data collection/validation Silverlight application for field crew/office personnel.",
              "Field crews upload data online as data are collected which is then evaluated by office personnel.",
              "Developed various kinds of 3D data visualization techniques using ArcGIS, KML/Google Earth, Silverlight 3, Bing Maps and field surveying data.",
              "Developed a QA software analysis tool using C# Winforms, WPF and SQL Server to QA the data.",
              "The statistical models in the system help to identify and correct the data quality issues.",
              "Developed a low-cost system to tie-in the field data to its geographic location by creating a software application using C# that interfaced with GPS instrument and road data collection equipment.",
              "Developed a new image capture software using C#, Sony Vegas to enable capturing of hi-definition images of pavements from video tapes for integration with pavement network data.",
              "Introduced concept of using open source alternatives such as Google Earth for cost-constrained clients to display pavement data and integrate with existing pavement management systems. "
            ]
          }      
        ]
      },
      {
        "id":5,
        "companyHeader":"UNIVERSITY OF TOLEDO, OH     /     August 2002 – December 2007     /     DOCTOAL RESEARCH ASSISTANT         ",
        "jobDescription":"",
        "projects":[
          {
            "id":0,
            "title":"Doctoral Student",
            "description":"Research Assistant",
            "responsibilities": [
              "Performed extensive research, development and analysis of pavement management information system (PMIS) for the Ohio Department of Transportation (ODOT).",
              "Liaised closely with ODOT Office of Pavement Engineering in gathering user requirements and delivering project updates.",
              "Developed Pavement Management Information System (PMIS) for ODOT.",
              "PMIS is a data input, analysis and reporting software in VB6, MS Access, DAO, ArcGIS and MapObjects.",
              "Spearheaded development and implementation of Aggregate Geographical Information System (AGIS) for ODOT using C#, ArcGIS, ArcObjects and Access for use in performing analysis of spatial statistics culled from pavement aggregate data.",
              "Skillfully analyzed and programmed into PMIS statistical models such as regression, Markov, Kaplan-Meier, Weibull and linear mixed effects.",
              "Utilized data mining algorithms such as cluster analysis, decision trees and fuzzy logic using C# and Java to identify existing patterns in ODOT data."
              
            ]
          }      
        ]
      }             
    ]
  },
  "skills":[
    { "id": 0, "skill": "Angular", "experience": "high" },  
    { "id": 1, "skill": "Angular Material", "experience": "high" },
    { "id": 2, "skill": "React", "experience": "med" }, 
    { "id": 3, "skill": "React Material UI", "experience": "med" }, 
    { "id": 4, "skill": "React Native", "experience": "low" },
    { "id": 4, "skill": "Redux", "experience": "low" },
    { "id": 5, "skill": "Data Science", "experience": "low" } ,
    { "id": 6, "skill": "Python", "experience": "high" },
    { "id": 7, "skill": "pandas", "experience": "high" } ,
    { "id": 8, "skill": "numpy", "experience": "high" } , 
    { "id": 9, "skill": "sklearn", "experience": "low" }, 
    { "id": 10, "skill": ".NET", "experience": "high" },
    { "id": 11, "skill": "Powershell", "experience": "med" }, 
    { "id": 12, "skill": "ASP.NET", "experience": "high" },
    { "id": 13, "skill": "C#", "experience": "high" } ,
    { "id": 14, "skill": "Azure", "experience": "high" } ,  
    { "id": 15, "skill": "App Insights", "experience": "med" },  
    { "id": 16, "skill": "Azure Functions", "experience": "high" },
    { "id": 17, "skill": "HTML", "experience": "high" },
    { "id": 18, "skill": "JavaScript", "experience": "high" },
    { "id": 19, "skill": "CSS", "experience": "med" },
    { "id": 20, "skill": "mongoDB", "experience": "high" },
    { "id": 20, "skill": "mongoose", "experience": "high" },
    { "id": 21, "skill": "SQL Server", "experience": "med" },
    { "id": 22, "skill": "Stored Procedures", "experience": "med" },
    { "id": 23, "skill": "Salesforce", "experience": "med" },
    { "id": 24, "skill": "APEX", "experience": "med" }, 
    { "id": 25, "skill": "AWS", "experience": "high" } ,
    { "id": 26, "skill": "AWS Lambda", "experience": "high" },
    { "id": 27, "skill": "SES", "experience": "high" },
    { "id": 28, "skill": "S3", "experience": "high" },
    { "id": 29, "skill": "Step Functions", "experience": "high" }, 
    { "id": 31, "skill": "CloudWatch", "experience": "med" }, 
    { "id": 32, "skill": "IBM Cloud", "experience": "low" },
    { "id": 33, "skill": "Cloud Functions", "experience": "low" },
    { "id": 34, "skill": "Nodejs", "experience": "med" },
    { "id": 35, "skill": "Jest", "experience": "high" },
    { "id": 36, "skill": "Karma", "experience": "med" },
    { "id": 37, "skill": "Knockout", "experience": "high" },
    { "id": 38, "skill": ".NETCore", "experience": "low" },
    { "id": 39, "skill": "Go", "experience": "low" },    
    { "id": 40, "skill": "Microservices", "experience": "high" },
    { "id": 41, "skill": "Services", "experience": "high" },
    { "id": 42, "skill": "Loopback", "experience": "high" },
    { "id": 43, "skill": "APIGEE", "experience": "med" },
    { "id": 44, "skill": "KafkaJs", "experience": "high" }
  ],
  "projects": [
    { "id":0, 
      "title": "gMath", 
      "description": "tiny math app created for my kid using React and Redux", 
      "url":"https://g-math.netlify.app", 
      "github":"",
      "language": "React,Redux"
     },
    { "id":1, 
      "title": "Python Coding Conventions", 
      "description": "Visual Studio Code extension for implementing python conventions", 
      "url":"https://marketplace.visualstudio.com/items?itemName=igress.python-coding-conventions", 
      "github":"" ,
      "language":"TypeScript"
    },
    { "id":2, 
      "title": "Print Class Instance", 
      "description": "Reflection methods created for extracting C# class properties created using C#", 
      "url":"https://www.nuget.org/packages/PrintClassInstance", 
      "github":"",
      "language": ".NETCore, C#"
    },
    { "id":3, 
      "title": "Custom Data Structure", 
      "description": "Custom tree data structure created in python and is used to represent a HTML DOM structure", 
      "url":"https://github.com/harip/python-html-ml", 
      "github":"",
      "language":"Python"
    }
  ]
}